* >Natural Source Header 000000
* :Mode S
* :CP ISO_8859-1:1987
* :LineIncrement 10
* <Natural Source Header
 
DEFINE DATA PARAMETER 
1 Cruise-Id-Delete (N8.0) 
LOCAL 
USING NCDEMAPL 
LOCAL 
1 #COUNTER (P10) INIT <0> 
END-DEFINE 
* 
FIND NCCRUISE CRUISE-ID = CRUISE-ID-DELETE 
  IF NO RECORDS FOUND 
    ESCAPE ROUTINE 
  END-NOREC 
  DELETE 
  END TRANSACTION 
  #COUNTER := #COUNTER - 1 
  CRUISE-ID-DELETE := #COUNTER 
*   
END-FIND 
* 
END 
  
